Terraform Plan Output:
```
module.appcd_c6b64537-fcfe-49fb-8cc7-1d15863db11d.aws_dynamodb_table.this: Refreshing state... [id=my-table]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.appcd_c6b64537-fcfe-49fb-8cc7-1d15863db11d.aws_dynamodb_table.this will be destroyed
  # (because aws_dynamodb_table.this is not in configuration)
  - resource "aws_dynamodb_table" "this" {
      - arn                         = "arn:aws:dynamodb:us-east-2:180217099948:table/my-table" -> null
      - billing_mode                = "PROVISIONED" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "id" -> null
      - id                          = "my-table" -> null
      - name                        = "my-table" -> null
      - read_capacity               = 1 -> null
      - stream_arn                  = "arn:aws:dynamodb:us-east-2:180217099948:table/my-table/stream/2024-10-09T19:13:16.881" -> null
      - stream_enabled              = true -> null
      - stream_label                = "2024-10-09T19:13:16.881" -> null
      - stream_view_type            = "NEW_IMAGE" -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {
          - "appstack" = "dogeapi"
        } -> null
      - tags_all                    = {
          - "appstack" = "dogeapi"
        } -> null
      - write_capacity              = 1 -> null
        # (1 unchanged attribute hidden)

      - attribute {
          - name = "id" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = true -> null
        }

      - server_side_encryption {
          - enabled     = true -> null
            # (1 unchanged attribute hidden)
        }

      - ttl {
          - enabled        = false -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.stackgen_5946a085-5560-51f9-8683-3b21d7bd5f37.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = {
                  + Action    = "sts:AssumeRole"
                  + Effect    = "Allow"
                  + Principal = {
                      + Service = "eks.amazonaws.com"
                    }
                }
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "DogeAPI-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.stackgen_b7bd0e6c-ba07-4584-aa1f-4ff2c0151f6d.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "Reader"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "DogeAPI-role"
    }

  # module.stackgen_e567b60b-9bea-4cd5-8672-f6f8a3bc6abd.aws_dynamodb_table.this will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "my-table"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_IMAGE"
      + tags             = {
          + "appstack" = "dogeapi"
        }
      + tags_all         = {
          + "appstack" = "dogeapi"
        }
      + write_capacity   = 1
        # (1 unchanged attribute hidden)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ aws_dynamodb_my_table_arn      = "arn:aws:dynamodb:us-east-2:180217099948:table/my-table" -> (known after apply)
  + aws_iam_role_dogeapi_role_arn  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```